#!/usr/bin/python3
# -*- coding: utf-8 -*-
# Создать файл с функциями (на своё усмотрение). Во втором файле подключить его как библиотеку и запустить функции.

import zadanie6lib

zadanie6lib.greet('misha')
zadanie6lib.say_goodbye('misha')
print(dir())